#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "8294dcda7ecd79fe10cecad0e3031ca3" -> "400895bbd9b4a995441079dcd57bfe5c"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "6113008ac53d290eea674694329c5199" -> "554e095724b7651318c489737dbda710"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "554c5167dfaa19b2465ef086c0a56385" -> "a246e88a9546add57124195937c6a9d5"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "1f669f21911d5d32cf194cd9710b580c" -> "670b839dfe39b84365896abdf3cccd52"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "9edd8d14cf13ed8d63cb9080f3844d17" -> "3f4344e1ec29d90d9b8054ed15962642"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "3051139060eb5187d0ce5cebbd04b5d5" -> "4d74961c2028307a4c81db33bc519c23"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "2d5cca92cc331abba506bcd753fc8614" -> "6b3b11f34ec964cb2ae84262acfe51bd"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "df053160a4e243f776e5a5a6105f7ff5" -> "70d20b8d80edc7a6641e2417a6f7f234"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "b1866ad2d9d589c1014096f9f5f15988" -> "a2c5b8e9a63f3b7f5d12319d260205d3"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "8a20be6dd5285dcff8ce362b7b4ae541" -> "8b9da7b7149c160061a2f9b6c900c01a"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "7c83e0adc4499c672a596037c8c22ee0" -> "18229175c2c3f43262c935bd12a3d896"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "7df183694d10624eecaecf7d640910f5" -> "6bba4527fdc3640ebc1a240a06727f6d"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "ac9a23db5f5163c1a10a662395f80922" -> "4cda1d45b9a107b316b34e869aae1cff"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "cb7a8639b92d7edd4ad3581f1196a83e" -> "3509084ef563490be09ff846a7eb0c4b"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "5c680d0f5a99822675932e74cf3a967b" -> "df2a55935d06e4fcc79e95086447a493"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "7b9ad441d613a51a6d10bf0431dfc739" -> "5abf10c6cfb0ad4e30258864220074d6"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "bbd55e41ec8b67f85c18bd559acffe2f" -> "547807e0fa77912a905ace273d904b58"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "aff8128a49fdaac7aa6f06ff9048107a" -> "ce26792291099c75535bd62b5ce9f24d"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "428f3db6fdaae48c33ae44dcb8a6dbf5" -> "564fdcac0c2ddbb188ff95b184dd0f1d"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "7958fa90f38ee1db3554cdfdc4b87a2b" -> "2af8a5bb6fa2aa74bf8d7028228972be"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "bd393099a3890e9f4cbc0c60169985fd" -> "580b2a7beb4074e0b6d539df32b2f01e"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "490f1076aee6d46e79f68105907fdd71" -> "f6c487b71826978bac3ddfe112d299df"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "2f7d83ab69ba26b12c8c6d703ed6bc23" -> "b6b61956a3d6347935c015857217ebc2"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "de07d4e4a59aad711dbce499372869cf" -> "5c27717ca7a2946377f43b8dc46e2886"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "d7220a913fc4b25b117f5037025c6d01" -> "eae4f1e8a0d415e429f6ebfbfa285574"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "9bf9da40e8b9041bf1ee634b5c7cf30e" -> "9af659bac8d00cb1aed4c8c1bc11a6e6"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "ce88b1497135ccdf156d3b8870c91e73" -> "92e0b140ddd73347adc35c8e3bb1a6aa"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "da2fc5fd5834fe99f87b9afd7d6542cb" -> "629f37d5096dec101533c3940acd886b"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "febf2936f2ee719c05a2d2d7b98c955e" -> "1a0c49a537e9c4b56da401af47b5f0f3"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "50f7fc23dec08efd544a62e0d314f933" -> "36b3404d56813df463ee364a5ae3faf3"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "8f99771ea291321c3da4f930e4f77bcc" -> "3e6a15f8aba3643bcb60a677333fee26"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "8a5e2cb48e938d7bf6da45dbcb4e8d93" -> "49a478ddc87cf273331ca02068cdd12e"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "ea05e198219b36712b3828e621a6aab2" -> "24d325d86ac3f451ee7565e8706fc595"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "4dd635146e2036708f442afcabd7ab6d" -> "5729319bd60a9562e13cc259733aae77"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "0a353b9fbc9b3728138af46cc5f5c8fe" -> "5c467e142449ca1e535ff7db6c55a115"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "26138f577106759df222289c309a77a2" -> "920c88b24b9b2905a3994070c3f3c9ac"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "3d37aab7b7e8ec8425ca0ddce96b0413" -> "2a96c84c9f3b374eb49daa3ce25a6a37"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "51b7f76a3bbfb50fb886e1971c399eb8" -> "c57f65ce30e75303b5a4170b59c7ce09"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "04fcb5ac1b444bb461c227733f1f5679" -> "56b12c6efe3b80eed7e6822e93f13194"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "af71d3525ec8cb370da0177a5c6e1db3" -> "e0a7208ee41c1432f502326b61978e2a"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "78007dec180bc75d6da164eb459f4efc" -> "3d48a1e9131521f7b7644c626a1b9606"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "fe920a13b975d13fe6403cebd8fc549a" -> "304c52f7a475249de5607e0f675f5095"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "77f6a82312c64c40bdc15e130a35c534" -> "60864984b1cf8d8fae0a8ad05e5d1b03"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "5dcde3bef79c505cee3301ca4a171bb0" -> "8b0f4df52ec74bb23ba66f92f851a713"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "9dfc25a66ce1901bccbdc4f9c28edbcc" -> "e6f8dbe35f90498b1901d16ab7852125"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "fbe8231c2b92b553bb7fa6cdacec3b9b" -> "7448a3b2c42317a8d63cb36806964927"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "2b660bf12f4ded56243ffa6dd01be76f" -> "5c4f5cc3cd740c89d962bef7da3ba3ab"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "aeocWkHcIReJj8UDnvQDE51ailIWPs1ST0HbwuVCiFw=" -> "pSlrTszzsckbpzRN2t+L0vULrINDZs9jkNgiLDWG74Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "O6Ws/0/F/7Sr5YCr89ynMGvNDVcsdAvKOUG8L0GyKu0=" -> "iG6ETPlU57zYGcKJ0/DSsAbXfOYpSN2xtuGTNZSgcKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "WQRlIOQSf8JE0m7Fnd2DKo8aLvn2eLu+3V64jUTEAX0=" -> "w8iwc2Qsguwh3OYjzZtx8nWHG7JPVDrtIyn/HT6qxUo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "eaAto1FzHJcqgTZFJQ0fEpYYodc1H/eI3N3YVGAVanw=" -> "8pNvc/qnDqGTZA3yp1QarsY1z3TVjUvIn8qCjt2WzeI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "/FZcHodPdSgtRKvBpnEXE1+AbNGju9ZsbEjnvuqt/Rs=" -> "nBJWPrVPwLEYbC1Rr2lvHqgxqEhvEPvw0CptbKym050="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "3W4iclMyfNoqv8gXh/sVN+qPweRO/UwXg2t8kMvMqKo=" -> "N/x9UU4oNZRmZiA603IxniNm/8/NIQcXh8FH9AvRXoU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "5SEHq8xQccFWN7cf/Mz37/HfL4jnFWbUfpwAWDC0A1E=" -> "D5up65aZHCPCm6NQJimjpOlvg1ptRwGKDv4lMEXlnEU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "+SuWHXaExhH/ii/m81DQ0N2KuSTFa48VH13N6gBXc60=" -> "mZv4765BnMlxN3gP1h3prjLY770OpiTtvblnQjKMzYs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GtHXJ0GbYpjnK9gyVMXcmLzn6ntbWtlQX7fuKNRxRA=" -> "zuHeKdAr5SREhlYZ+fZ70tgkeX48pZRMrO4Rinr8L8s="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "J5uNTJ9sbT8cJ1XlG7U1vW+MClOGwaHn7VZk6tUlJkM=" -> "jAzsEtKHNQf9UQB+IlYqAbhafb4pCfwlLH6g3Wxn840="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "HH+XCJpbZDXhr2K08akaE3BYq7YOpOwvW0i1QudZDMY=" -> "UaZ61J2sSWu/RrBng6UAxVY/pLEnv4Sm7ufpdbVI0aU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "dYz/cbU2jTtf05LeUx6qxsYzYJLTlVJqAEism3hUeJ4=" -> "L1n8OuGbWb3hbMNotAo/uBOgMVBZloB6KIKOfxQUtC0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "YYwxYDuFunNAReCs2vzgA7HKqi81BIDJ+nzvA8ImYN0=" -> "QWulK2vU+9Ll3t/e8Fpsk2OEVwH6ghYFnOvyFfd01YY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "/AcXA07nFigCRhIKWlX9DW7gQhHpgDR0kIxPEKvB7T0=" -> "pJuX1RPbYL9uX3WenoswxqKkQJvKzxMT2LUi6e6kfMM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "QS6s5s6TD8il8ZuCGCw1NvzqcI9PRf5U7EGm8pRXcoU=" -> "TZ511WMN6YNpGnHl1wLwkFlqavVQwRscRWMFSjvZ/HY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "uQAQ48YV6Ckq/Lg5wOd0xpTkF3nO4cGCO9wDSVpR1eY=" -> "iRzahdfJwd8nWSKAWz2kUSj3MMJOHlbdFsWod+Yk+dM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "CbwIUQB3KWx2uxKGYxnaziFMJyFAeZi7Vu+uDQhzXfQ=" -> "/NMUnt/Xdpr4TuATJOEjGQE0zBDKA+ViQRKLl1M5o1A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BdLefjjTtRUuK3+WIEIS8X1XKzovqjJWpqnRjUiofJc=" -> "wiS5/QJbbvkO0SEu0G5DxjjTELjhuYnQsRPSiy07Z0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2p1aGQvR0mStvgzdgR/0iCZ8lBUFungWbczHhQ7afc=" -> "vY/1PSkGj3ZaHW/MENZyxE+fJJlhsA8G+vKf7WpW7X8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BNUvj+wNCNv7/qjEeM0B/tp8Ip3v7CVcs2B3ngdEuBU=" -> "g2RE3tPy16IlHh7JscYBbFCPUzM07Fi1vQ+H+eMskhs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZlF+Izxx3cnuvjaetk2YPKs6VmbbxL5bVAEcOxUSe4Q=" -> "kK97JRSG7L7I7s0BmNxx46jD0FejjfCd07WjCckW8Oc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "I9gTVacTakmbrbr/W5/uHQ1ILSGfxu1YNN7G/GP5qYs=" -> "FddA7xZyvH4THCj23H3wMlM/y6S6cndxpqeIQJs64gc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "QmF/XPc0nEts+lBc8YulEsUv30CL/TQvomUGCwuXVvY=" -> "/TSjY3JNE/M6aXtTFEU8U7QVAFdgNkpW9ntt3ThPdEs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "VvX5jl0Sw2PdnUot/rRq3uu3SWct5E8pJl2yaCqBcpg=" -> "qr1YRbv045J5OmDtXD1LStiiDCdNTi8X0cPxd90M7PI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "HQDGVQSCy5gj3UMVCyluj84+DAedvUBkvQ06efD1LxE=" -> "HiPzlrMpBOEOSCg6B7kyU+4E/UkZY7OyAEmBAvxJ4KU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "5pGtqRXU5XFf6+evdg7YxOeGlhCb5aa3VCCoidTQH0w=" -> "gvMRrbk1T456Z2p6TLLrMRXAbZvJ/yd5H5fOqioTVPY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAG4bOqww4GxGf5WtHGDEV+oLDEgJeO4Our74xsK2vI=" -> "TfY82NWhTr/Dg6opM39shKjSLHzNGBv9V7RHRGjfNiE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "bmrpc3AICRPT4zcmkT6Pk/g1g0vAyplOY8iR4g+vS/U=" -> "niyhLJtkV8wssJB61ibthFr1tA/bjHxJ3lnHGohOGCI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "aewkx99UUTlxSlCYzzZd1UZ/lJOcKLaxVa76qWVRJGA=" -> "MBjycFxqnPwj4CkPjH4vu+AiQtn/Q12RiUelx7D5CrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "65HtkYQMCbLb87CbwOgP+SyqekuDkjzQYXTCZW0X6io=" -> "c3cAkpZZC4cX71wpyR3+MRpDx01c765cHAMc9OCts/Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-17T14:26:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRNR+UJvN2WmYLULAJPB0FubGzXFEm0QMeOXww8rT0Q=" -> "Tr2IpFeb2ZC1EluCfQySkxWGINym5VRYF7MWp6GPuu4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "7sA7OKYpJ0+2YN7yE++KfnFJyBICdKcJ7JkjVT1qwYk=" -> "97VUXxHFAjJr7Cdogf2TXb6MiUeRzk1hzPvyH3PoQnU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "503sWSOagtIRwIdQK7KZ1Pfm1Dh9kFo7mp7XrnEXzOE=" -> "+dvIoNeLlzStRVor4a/agHl1DvttkZx2sksceu+uq4g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2G3yt4lHXIRONk6eyjNuC4FKG/rLBk2FL4QUB1mGys=" -> "U0KwWmLBpAp+JMU7tNhLb0/gPPW1LRJgiG10d6DCPdA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "omIfBh7mXGtAF6vs3o2dWpyjLnPfCqPbAo0+qFVspUA=" -> "kCiv1tMerMAEvzKZVRWKu2YMSnhE1edmb2R18Td3fnk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Vf+l8fS4qnsOXzQu5lUtSp9gQxOAh9DAAhCqiOkTobU=" -> "Vk/uLfNz5M6ZaYGsEpwNacwEDTg4sKIRbaFHdUZd9vk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-15T23:09:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "w2d/Dco1+zRQ/3d82tYvxBuj0uL92cBT/6t3rfAhNRU=" -> "D9iUrccqkD3EPgxoVys4f80It7/4DPJGrRH9JfpZM7g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y4IK+eLkLfo2pkrnK8xbEQq0EehTOhSYYB8tLczJHrs=" -> "RbyEN+tB+Qa0robyY02Rk/WI3K/QjDZ2+dE0uZojwdU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "JxPkmKs8wH+inc6CGSzvoOq/8YV6VqFMtynUErEoc98=" -> "Ws8ZhkGj1O9TvXZQgqLZk2A7yMOh1zdlqpWbTWdHTQE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "G2CMktItheKYHrpkCze4xxpt5j8WJZCdyOzJgATQa0s=" -> "RSFRaTPXx1C8DBot2aLnBps1sT4fl9so95BqdEd2WWA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "GAcV1xsjODZIWLuwqCJ7+U6EMl+pqGqKIhpyjFYzmas=" -> "0NWxl1vHWv5cSdWkokCn8uCsYQv7ZlIa2tdjsQTFV5g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "6EaLwgys0nd62SxVh8Pff/yeB/autd+XG0Ju51wWwUU=" -> "F0d8T60S664fJOia8mAl2930Bw83GKOe1WE8g0jk6wc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ix6nNKj8DcY9mcD/YHOwgBWYNITn2UlyaeOy3rS6m3U=" -> "RylHd2NTrStPgCahNa8COeGXb0J719E9DorXUMC5wNk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "fOixT9KLZKPS6Dm6i5dif9ml8zELAzQh4D0/N/uI684=" -> "Sd1QDuXOaeHEnivQ1DgyPqU6r6TjfcF8z/X0TfPBiqw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "QqxOJZNDnfIRoiUxQKlGRiysciOkXvSbmhS66KlOqxE=" -> "T/9qe3g5fQOC4xgU6SnfwJkC2VEDxqVEl3GrbsEMpNY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-15T23:08:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "8RE3+xt1894hF3iqmeHC1fnPEOeHoNjgh3wh3l/9Mbw=" -> "TjKtoDAd0VNqqBh/BjvP0Xp4BMV2G7xq2JaBPD70x2I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-15T23:08:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vglks1" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-15T23:08:13Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-15T23:08:10Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*